artillery.io/performance-tests.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 30
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 120
      arrivalRate: 50
      name: Sustained load

before:
  flow:
    - log: "Get auth token"
    - post:
        url: "/login"
        json:
          login: "admin"
          password: "admin"
        capture:
          - json: $.token
            as: token

scenarios:
  - name: "Boards Endpoints"
    flow:
      - get:
          url: "/boards"
          headers:
            authorization: "Bearer {{ token }}"
      - post:
          url: "/boards"
          headers:
            authorization: "Bearer {{ token }}"
          json:
            title: "Board Title"
            columns: [{"title":"Backlog","order":1},{"title":"Sprint","order":2}]
          capture:
            - json: $.id
              as: boardId
      - get:
          url: "/boards/{{ boardId }}"
          headers:
            authorization: "Bearer {{ token }}"        
      - put:
          url: "/boards/{{ boardId }}"
          headers:
            authorization: "Bearer {{ token }}"
          json:
            title: "Board Title Updated"
      - delete:
          url: "/boards/{{ boardId }}"
          headers:
            authorization: "Bearer {{ token }}"